src/Configuration/Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаОказана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Configuration/Documents/ЗаписьКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УслугаУслугаПриИзменении(Элемент)
	  СтрокаТЧ = Элементы.Услуга.ТекущиеДанные;
  Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
	  СтрокаТЧ.Стоимость = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Услуга,,Объект.Дата);
  Иначе
	  СтрокаТЧ.Стоимость = 0;
  КонецЕсли;
  

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если Объект.Ссылка.Пустая() Тогда

Если Параметры.Свойство("Начало") Тогда 
Объект.ДатаЗаписи = Параметры.Начало;
КонецЕсли;

Если Параметры.Свойство("Окончание") Тогда
Объект.ДатаОкончанияЗаписи = Параметры.Окончание;
КонецЕсли;

Если Параметры.Свойство("Сотрудник") Тогда
Объект.Сотрудник = Параметры.Сотрудник;
КонецЕсли;

Если ЗначениеЗаполнено(Объект.ДатаЗаписи) Тогда
Объект.Дата = НачалоДня(Объект.ДатаЗаписи);
КонецЕсли;    

КонецЕсли;  


УстановитьДоступностьЭлементовФормы();
КонецПроцедуры   
&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
    Если РольДоступна("ПолныеПрава") Тогда
        Элементы.УслугаОказана.ТолькоПросмотр = Ложь;
    КонецЕсли;        
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	  Оповестить("Записан заказ");
  КонецПроцедуры
